export interface Qustion {
  id: number;
  question: string;
}

export const questions = [
  {
    id: 0,
    question: "Я чувствую себя комфортно, когда завожу новые знакомства.",
  },
  { id: 1, question: "Мне важно быть в центре внимания партнера." },
  {
    id: 2,
    question: "Я часто сомневаюсь, любит ли меня человек, с которым я близок.",
  },
  {
    id: 3,
    question: "Я стараюсь избегать эмоциональной зависимости от других.",
  },
  {
    id: 4,
    question:
      "Мне нравится поддерживать близость в отношениях, но при этом я ценю свою свободу.",
  },
  { id: 5, question: "Я боюсь быть отвергнутым." },
  {
    id: 6,
    question: "Когда кто-то начинает сближаться со мной, я могу отдаляться.",
  },
  { id: 7, question: "Я легко выражаю свои чувства и эмоции другим людям." },
  {
    id: 8,
    question: "Я часто беспокоюсь, что партнер может уйти из моей жизни.",
  },
  {
    id: 9,
    question:
      "Я считаю, что близкие отношения приносят больше радости, чем проблем.",
  },
  {
    id: 10,
    question: "Я чувствую тревогу, если не получаю достаточно внимания.",
  },
  {
    id: 11,
    question: "Мне трудно доверять людям, даже если они заслуживают доверия.",
  },
  {
    id: 12,
    question: "Я стараюсь избегать конфликтов, даже если это мешает общению.",
  },
  {
    id: 13,
    question: "Я боюсь, что партнер может посчитать меня недостаточно хорошим.",
  },
  { id: 14, question: "Я часто чувствую потребность в одобрении от близких." },
  {
    id: 15,
    question:
      "Когда партнер хочет обсудить важную тему, я стараюсь уйти от разговора.",
  },
  {
    id: 16,
    question:
      "Я легко устанавливаю близкие связи, но не чувствую потребности в постоянной проверке их прочности.",
  },
  {
    id: 17,
    question: "Иногда я чувствую себя ненужным или недостойным любви.",
  },
  {
    id: 18,
    question: "Я избегаю слишком эмоциональных обсуждений в отношениях.",
  },
  {
    id: 19,
    question:
      "Я боюсь потерять контроль в отношениях, поэтому предпочитаю держать дистанцию.",
  },
  {
    id: 20,
    question:
      "Мне сложно понять, почему другие люди хотят быть со мной близкими.",
  },
  {
    id: 21,
    question: "Я часто чувствую, что не могу полностью открыться партнеру.",
  },
  { id: 22, question: "Я боюсь, что слишком много требую от партнера." },
  {
    id: 23,
    question: "Мне нравится поддерживать близость, но я ценю свои границы.",
  },
  {
    id: 24,
    question: "Я верю, что любовь может быть стабильной и безопасной.",
  },
];
